<!DOCTYPE html>
<html lang="ru">
	<head>
		<meta charset="UTF-8">
		<title>Выполнение домашнего задания PHP от 17.01.2017</title>
	</head>
	<body>
		<h1>Выполнение домашнего задания PHP от 17.01.2017</h1>
		<h2>volovodenko@gmail.com</h2>
		<br>
		<p><b>Задачи по основам PHP<br>
		Все задания должны выполняться в папке php_basics_tasks, в отдельных файлах, 
		которые должны называться по номеру задания, например, "17.php".<br>
		Если задание требует создания нескольких файлов - то такие файлы необходимо 
		размещать в папке, название которой равно номеру задания.</b>
		</p>
		
		<ol>
			<li>
                <a href="php_basics_tasks/load.php?task=1">
                    Создайте переменную name и присвойте ей
                    значение, содержащее ваше имя, например "Иннокентий".
                </a>
            </li>
            <li>
                <a href="php_basics_tasks/load.php?task=2">
                    Создайте переменную age и присвойте ей значение, содержащее ваш возраст, например 20.
                </a>
            </li>
            <li>
                <a href="php_basics_tasks/load.php?task=3">
                    Выведите с помощью echo фразу "Меня зовут: %ваше_имя%", например: "Меня зовут: Иннокентий".
                </a>
            </li>
            <li>
                <a href="php_basics_tasks/load.php?task=4">
                    Выведите фразу "Мне %ваш_возраст% лет", например: "Мне 20 лет".
                </a>
            </li>
            <li>
                <a href="php_basics_tasks/load.php?task=5">
                    Напишите конструкцию if, которая выводит фразу: "Вам еще работать
                    и работать" при условии, что значение переменной age попадает в диапазон
                    чисел от 18 до 59 (включительно).
                </a>
            </li>
            <li>
                <a href="php_basics_tasks/load.php?task=6">
                    Расширьте конструкцию if из п.5, выводя фразу: "Вам пора на пенсию"
                    при условии, что значение переменной age больше 59.
                </a>
            </li>
            <li>
                <a href="php_basics_tasks/load.php?task=7">
                    Расширьте конструкцию if из п.5-6, выводя фразу: "Вам еще рано работать"
                    при условии, что значение переменной age попадает в диапазон чисел от 0 до 17
                    (включительно).
                </a>
            </li>
            <li>
                <a href="php_basics_tasks/load.php?task=8">
                    Расширьте конструкцию if из п.5-7, выводя фразу: "Неизвестный возраст" при
                    условии, что значение переменной age является отрицательным числом, или вовсе
                    числом не является.
                </a>
            </li>
            <li>
                <a href="php_basics_tasks/load.php?task=9">
                    Создайте переменную day и присвойте ей произвольное числовое значение.
                </a>
            </li>
            <li>
                <a href="php_basics_tasks/load.php?task=10">
                    С помощью конструкции switch выведите фразу: "Это рабочий день", если
                    значение переменной day попадает в диапазон чисел от 1 до 5 (включительно).
                </a>
            </li>
            <li>
                <a href="php_basics_tasks/load.php?task=11">
                    С помощью конструкции switch выведите фразу: "Это выходной день",
                    если значение переменной day попадает в диапазон чисел от 6 до 7 (включительно).
                </a>
            </li>
            <li>
                <a href="php_basics_tasks/load.php?task=12">
                    С помощью конструкции switch выведите фразу: "Неизвестный день",
                    если значение переменной day не попадает в диапазон чисел от 1 до 7 (включительно).
                </a>
            </li>
            <li>
                <a href="php_basics_tasks/load.php?task=13">
                    Заданы две переменные: s - длина участка, который проехал автомобиль;
                    t - время движения в часах. Вывести скорость автомобиля на заданном участке в км/час и в м/сек.
                </a>
            </li>
            <li>
                <a href="php_basics_tasks/load.php?task=14">
                    Задана переменная $foo = 'bar'; Создать переменную bar, в которой будет
                    храниться число 10. Вывести число 10, используя только переменную $foo (не опечатка).
                </a>
            </li>
            <li>
                <a href="php_basics_tasks/load.php?task=15">
                    Написать калькулятор. Переменная $a = изменяемое число.
                    Переменная $b = изменяемое число.
                    Переменная $operator = ‘+’ или ‘-’ или ‘/’ или ‘*’ или '%' (остаток от деления).<br>
                    На экран выводить результат в зависимости от значений этих переменных.
                    Не забудьте про деление на 0, если надо - выдавать ошибку что на 0 делить нельзя.
                </a>
            </li>
		</ol>
	</body>
</html>